# ДЗ1-1: Практическое задание 1
# Необходимо написать программу,
# которая будет считывать со стандартного ввода имя пользователя
# и выводить приветствие вида “Hello, [Username]”.
name = input()
print("Hello, " + name)