# ДЗ5-1: Практическое задание 5
# Необходимо написать программу,
# которая будет считывать три числа и выводить их в определенном формате.
# Первое число целое, второе с плавающей точкой, третье целое неотрицательное.
# По примерам необходимо определить требуемый формат данных.
a = int(input())
b = float(input())
c = int(input())
# +000000102
# ######3.14
# 0000_0100_0110_011
print(f"{a:+010}")
print(f"{b:#>10.2f}")
c_bin = f"{c:b}"
print(c_bin)
# print(len(c_bin))
if len(c_bin) % 4 == 0 and len(c_bin) > 16:
    str = '_'.join([c_bin[i:i + 4] for i in range(0, len(c_bin), 4)])
else:
    l = len(c_bin) + 4 - (len(c_bin) % 4) if len(c_bin) > 16 else 16
    # print(l)
    ccc = f"{c_bin:0>{l}}"
    str = '_'.join([ccc[i:i + 4] for i in range(0, len(ccc), 4)])

print(str)
print(int('10000000000000000', 2)) # 65536
# +10211111112
# ####103.00
# ######3.14
# ###-123.70
# 0001_0000_0000_0000_0000 65536
# 1 0000 0000 0000 0000